CSI API ETABS v1
cAreaObj.GetLocalAxes Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLocalAxes(
	string Name,
	ref double Ang,
	ref bool Advanced
)
Function GetLocalAxes (
	Name As String,
	ByRef Ang As Double,
	ByRef Advanced As Boolean
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim Ang As Double
Dim Advanced As Boolean
Dim returnValue As Integer
returnValue = instance.GetLocalAxes(Name,
	Ang, Advanced)
int GetLocalAxes(
	String^ Name,
	double% Ang,
	bool% Advanced
)
abstract GetLocalAxes :
        Name : string *
        Ang : float byref *
        Advanced : bool byref -> int
Parameters
Name
Type: System.String
Ang
Type: System.Double
Advanced
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace